Repository: nafeal3mri/eclipsear
Catalog: lib/l10n/app_*.arb
Languages: ar

# eclipseType
source: {eclipseType, select, solarnotVisible{Not visible in location} solartotalEclipse{Total eclipse} solarannularEclipse{Annular elipse} solarpartialEclipse{Partial eclipse} penumbralEclipse{Penumbral eclipse} lunarnotVisible{Not visible in location} lunartotalEclipse{Total eclipse} lunarannularEclipse{Annular elipse} lunarpartialEclipse{Partial eclipse} lunarpenumbralEclipse{Penumbral eclipse} other{No data}}
ar: {eclipseType, select, solarnotVisible{غير ظاهر في منطقتك} solartotalEclipse{كسوف كلي} solarannularEclipse{كسوف حلقي} solarpartialEclipse{كسوف جزئي}lunarnotVisible{غير ظاهر في منطقتك} lunartotalEclipse{خسوف كلي} lunarannularEclipse{خسوف حلقي} lunarpartialEclipse{خسوف جزئي} lunarpenumbralEclipse{خسوف شبه الظل} other{لا يوجد بيانات}}

source: Days
ar: يوم

source: Year
ar: سنة

source: Years
ar: سنوات

source: Month
ar: شهر

source: Months
ar: أشهر

source: View More
ar: عرض المزيد

source: Max
ar: ذروة الكسوف

source: Start
ar: بداية الكسوف

source: End
ar: نهاية الكسوف

source: Solar Eclipse
ar: كسوف الشمس

source: Lunar Eclipse
ar: خسوف القمر

source: Settings
ar: الاعدادات

# language
source: اللغة
ar: Language

source: Location
ar: الموقع

source: Set location
ar: اختر الموقع

source: Select from Map
ar: اختر من خريطة

source: Select from list
ar: اختر من قائمة

source: Eclipse details
ar: تفاصيل الكسوف

source: View eclipse map
ar: استعرض خريطة الكسوف

source: Eclipse path
ar: مسار الكسوف

source: Eclipse simulation
ar: محاكاة الكسوف

# ecVisibility
source: {EclipseVisibility, select, notVisibleShort{Not visible} other{Visible}}
ar: {EclipseVisibility, select, notVisibleShort{غير ممكنة} other{ممكنة}}

source: Visibility
ar: امكانية المشاهدة

# eclipseTypes
source: Eclipse type
ar: نوع الكسوف

source: Date
ar: التاريخ

source: Magnitude
ar: حجم الكسوف

source: Coverage
ar: التغطية

source: Hours
ar: ساعة

source: Minutes
ar: دقيقة

source: Douration
ar: المدة

# aboutus
source: About EclipseAR
ar: عن EclipseAR

# learnaboutus
source: Want to know about us?
ar: تعرف علينا :)

# aboutuscontent
source: EclipseAR is a solar/lunar eclipse calender, some sources were used to make this app - NASA (https://eclipse.gsfc.nasa.gov) - © Dominic Ford (https://in-the-sky.org) This app DO NOT require any spicial permissions to your phone (Except Geolocation), it's optional, you can disable it whenever you want. If you interested to help translate this app to your language please contact me at info@nafe.me
ar: تطبيق EclipseAR هو تطبيق لحساب مواعيد خسوف القمر وكسوف الشمس, تم برمجة هذا التطبيق بالاستعانة ببعض المصادر - NASA (https://eclipse.gsfc.nasa.gov) - © Dominic Ford (https://in-the-sky.org) لا يطلب هذا التطبيق اي اذونات خاصة عدا أذونات اختيارية (الموقع الجغرافي) يمكنك تفعيلها والغاء تفعيلها في أي وقت تابعني على منصات التواصل الاجتماعي Twitter - snapchat - Instagram @nafe_al3mri If you interested to help translate this app to your language please contact me at info@nafe.me

source: Eclipse Ended
ar: انتهى الكسوف
